app/Models/Pharmacy/PharmacyBillingModel.php

SELECT `pharmacy_billings`.*, `patients`.`first_name`, `patients`.`last_name`, `patients`.`phone_number`, `users`.`first_name` AS `sales_person_first_name`, `users`.`last_name` AS `sales_person_last_name`
FROM `pharmacy_billings`
JOIN `patients` ON `patients`.`id` = `pharmacy_billings`.`patient_id`
LEFT JOIN `users` ON `users`.`id` = `pharmacy_billings`.`sales_person_id`
WHERE `pharmacy_billings`.`sales_person_id` = 17
AND `bill_date` >= '2025-08-20 00:00:00'
AND `bill_date` <= '2025-09-19 23:59:59'
ORDER BY `bill_date` DESC
---
    public function getInHospitalSalesBySalesPerson(int $salesPersonId, string $startDate, string $endDate)
    {
        return $this->select('pharmacy_billings.*, patients.first_name, patients.last_name, patients.phone_number, users.first_name AS sales_person_first_name, users.last_name AS sales_person_last_name')
                    ->join('patients', 'patients.id = pharmacy_billings.patient_id')
                    ->join('users', 'users.id = pharmacy_billings.sales_person_id', 'left')
                    ->where('pharmacy_billings.sales_person_id', $salesPersonId) // Filter by sales person ID
                    ->where('bill_date >=', $startDate . ' 00:00:00')
                    ->where('bill_date <=', $endDate . ' 23:59:59')
                    ->orderBy('bill_date', 'DESC')
                    ->findAll();