app/Models/Pharmacy/PharmacySalesModel.php

SELECT `pharmacy_sales`.*, `users`.`first_name` as `sales_person_first_name`, `users`.`last_name` as `sales_person_last_name`
FROM `pharmacy_sales`
JOIN `users` ON `users`.`id` = `pharmacy_sales`.`sales_person_id`
WHERE `pharmacy_sales`.`sales_person_id` = 17
AND `prescription_type` = 'outside_sale'
AND `sale_date` >= '2025-08-20 00:00:00'
AND `sale_date` <= '2025-09-19 23:59:59'
ORDER BY `sale_date` DESC
---
    public function getOutsideSalesBySalesPerson(int $salesPersonId, string $startDate, string $endDate)
    {
        return $this->select('pharmacy_sales.*, users.first_name as sales_person_first_name, users.last_name as sales_person_last_name')
                    ->join('users', 'users.id = pharmacy_sales.sales_person_id')
                    ->where('pharmacy_sales.sales_person_id', $salesPersonId) // Filter by sales person ID
                    ->where('prescription_type', 'outside_sale')
                    ->where('sale_date >=', $startDate . ' 00:00:00')
                    ->where('sale_date <=', $endDate . ' 23:59:59')
                    ->orderBy('sale_date', 'DESC')
                    ->findAll();