app/Controllers/Pharmacy/Dashboard.php

    public function index()
    {
        // 1. Fetch Total Medicines
        $totalMedicines = $this->medicineModel->countAllResults();

        // 2. Fetch Total Sales for Today
        $today = Time::today()->toDateString();
        $totalSalesToday = $this->salesModel
            ->selectSum('total_amount')
            ->where('DATE(created_at)', $today)
            ->first();

        $totalBillingToday = $this->billingModel
            ->selectSum('total_amount')
            ->where('DATE(created_at)', $today)
            ->first();
        $totalSales = ($totalSalesToday['total_amount'] ?? 0) + ($totalBillingToday['total_amount'] ?? 0);

        // 3. Fetch Low Stock Items
        $lowStockThreshold = 10;
        $lowStockItems = $this->medicineModel
            ->select('pharmacy_medicines.id')
            ->join('pharmacy_batches', 'pharmacy_batches.medicine_id = pharmacy_medicines.id', 'left')
            ->selectSum('pharmacy_batches.current_stock', 'total_stock')
            ->having('total_stock <', $lowStockThreshold)
            ->groupBy('pharmacy_medicines.id')
            ->countAllResults();

        // 4. Fetch Items Expiring Soon (within the next 6 months)
        $expiringSoonItems = $this->batchModel
            ->where('expiry_date <', Time::now()->addMonths(6)->toDateString())
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `pharmacy_medicines`.`id`, SUM(`pharmacy_batches`.`current_stock`) AS `total_stock`
FROM `pharmacy_medicines`
LEFT JOIN `pharmacy_batches` ON `pharmacy_batches`.`medicine_id` = `pharmacy_medicines`.`id`
GROUP BY `pharmacy_medicines`.`id`
HAVING `total_stock` < 10
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM `pharmacy_batches`
WHERE `expiry_date` < '2026-03-20'

        $recentSales = $recentSalesQuery->getResultArray();

        // 6. Fetch Upcoming Expiry Batches (e.g., next 5)
        $expiringSoonBatches = $this->batchModel
            ->select('pharmacy_batches.batch_number, pharmacy_batches.expiry_date, pharmacy_batches.current_stock, pharmacy_generics.generic_name')
            ->join('pharmacy_medicines', 'pharmacy_medicines.id = pharmacy_batches.medicine_id')
            ->join('pharmacy_generics', 'pharmacy_generics.id = pharmacy_medicines.generic_id')
            ->where('expiry_date <', Time::now()->addMonths(6)->toDateString())
            ->orderBy('expiry_date', 'ASC')
            ->limit(5)
            ->findAll();
---
SELECT `pharmacy_batches`.`batch_number`, `pharmacy_batches`.`expiry_date`, `pharmacy_batches`.`current_stock`, `pharmacy_generics`.`generic_name`
FROM `pharmacy_batches`
JOIN `pharmacy_medicines` ON `pharmacy_medicines`.`id` = `pharmacy_batches`.`medicine_id`
JOIN `pharmacy_generics` ON `pharmacy_generics`.`id` = `pharmacy_medicines`.`generic_id`
WHERE `expiry_date` < '2026-03-20'
ORDER BY `expiry_date` ASC
 LIMIT 5