app/Controllers/Pharmacy/Medicines.php

    public function index()
    {
        $medicines = $this->medicineModel
            ->select('pharmacy_medicines.*, pm.name as manufacturer_name, pc.name as category_name, SUM(pb.current_stock) as total_stock')
            ->join('pharmacy_manufacturers pm', 'pm.id = pharmacy_medicines.manufacturer_id')
            ->join('pharmacy_categories pc', 'pc.id = pharmacy_medicines.category_id')
            ->join('pharmacy_batches pb', 'pb.medicine_id = pharmacy_medicines.id', 'left') // LEFT JOIN to include medicines with no batches yet
            ->groupBy('pharmacy_medicines.id') // Group by medicine to sum batches
            ->findAll();
---
SELECT `pharmacy_medicines`.*, `pm`.`name` as `manufacturer_name`, `pc`.`name` as `category_name`, SUM(pb.current_stock) as total_stock
FROM `pharmacy_medicines`
JOIN `pharmacy_manufacturers` `pm` ON `pm`.`id` = `pharmacy_medicines`.`manufacturer_id`
JOIN `pharmacy_categories` `pc` ON `pc`.`id` = `pharmacy_medicines`.`category_id`
LEFT JOIN `pharmacy_batches` `pb` ON `pb`.`medicine_id` = `pharmacy_medicines`.`id`
GROUP BY `pharmacy_medicines`.`id`

    public function store()
    {
        $rules = [
            'generic_name'    => 'required|min_length[3]|max_length[255]',
            'dosage_form'     => 'required|max_length[100]',
            'strength'        => 'required|max_length[100]',
            'unit_of_measure' => 'required|max_length[50]',
            'manufacturer_id' => 'required|integer',
            'category_id'     => 'required|integer',
            'reorder_level'   => 'required|integer|greater_than_equal_to[0]'
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->medicineModel->save([
            'generic_name'       => $this->request->getPost('generic_name'),
            'brand_name'         => $this->request->getPost('brand_name'),
            'dosage_form'        => $this->request->getPost('dosage_form'),
            'strength'           => $this->request->getPost('strength'),
            'unit_of_measure'    => $this->request->getPost('unit_of_measure'),
            'manufacturer_id'    => $this->request->getPost('manufacturer_id'),
            'category_id'        => $this->request->getPost('category_id'),
            'reorder_level'      => $this->request->getPost('reorder_level'),
            'is_active'          => $this->request->getPost('is_active') ? 1 : 0,
            'description'        => $this->request->getPost('description'),
            'created_by_user_id' => session()->get('user_id') // Assuming user_id is in session
        ]);
---
SELECT *
FROM `pharmacy_dosage_forms`