app/Controllers/Pharmacy/Purchases.php

    public function bySupplier($supplierId)
    {
        $supplier = $this->supplierModel->find($supplierId);
        if (!$supplier) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Supplier not found');
        }

        // Fetch batch details joined with medicines and related tables for this supplier
        $builder = $this->batchModel
            ->select('pharmacy_batches.*, pm.generic_id, pm.brand_id, pm.strength, uom.name AS unit_of_measure_name, pm.dosage_form_id, pm.category_id, pm.manufacturer_id,
              pb.brand_name, pg.generic_name, df.name AS dosage_form_name, cat.name AS category_name, man.name AS manufacturer_name,
              (pharmacy_batches.initial_quantity) AS total_purchased_qty,
              (pharmacy_batches.current_stock) AS remaining_qty')
            ->join('pharmacy_medicines pm', 'pm.id = pharmacy_batches.medicine_id')
            ->join('pharmacy_brands pb', 'pb.id = pm.brand_id')
            ->join('pharmacy_generics pg', 'pg.id = pm.generic_id')
            ->join('pharmacy_units_of_measure uom', 'uom.id = pm.unit_of_measure_id', 'left')
            ->join('pharmacy_dosage_forms df', 'df.id = pm.dosage_form_id', 'left')
            ->join('pharmacy_categories cat', 'cat.id = pm.category_id', 'left')
            ->join('pharmacy_manufacturers man', 'man.id = pm.manufacturer_id', 'left')
            ->where('pharmacy_batches.supplier_id', $supplierId)
            ->orderBy('pharmacy_batches.expiry_date', 'ASC');





        $batches = $builder->findAll();
---
SELECT `pharmacy_batches`.*, `pm`.`generic_id`, `pm`.`brand_id`, `pm`.`strength`, `uom`.`name` AS `unit_of_measure_name`, `pm`.`dosage_form_id`, `pm`.`category_id`, `pm`.`manufacturer_id`, `pb`.`brand_name`, `pg`.`generic_name`, `df`.`name` AS `dosage_form_name`, `cat`.`name` AS `category_name`, `man`.`name` AS `manufacturer_name`, (pharmacy_batches.initial_quantity) AS total_purchased_qty, (pharmacy_batches.current_stock) AS remaining_qty
FROM `pharmacy_batches`
JOIN `pharmacy_medicines` `pm` ON `pm`.`id` = `pharmacy_batches`.`medicine_id`
JOIN `pharmacy_brands` `pb` ON `pb`.`id` = `pm`.`brand_id`
JOIN `pharmacy_generics` `pg` ON `pg`.`id` = `pm`.`generic_id`
LEFT JOIN `pharmacy_units_of_measure` `uom` ON `uom`.`id` = `pm`.`unit_of_measure_id`
LEFT JOIN `pharmacy_dosage_forms` `df` ON `df`.`id` = `pm`.`dosage_form_id`
LEFT JOIN `pharmacy_categories` `cat` ON `cat`.`id` = `pm`.`category_id`
LEFT JOIN `pharmacy_manufacturers` `man` ON `man`.`id` = `pm`.`manufacturer_id`
WHERE `pharmacy_batches`.`supplier_id` = '1'
ORDER BY `pharmacy_batches`.`expiry_date` ASC