app/Controllers/Pharmacy/Reports.php

    public function sales()
    {
        $startDate = $this->request->getGet('start_date') ?? date('Y-m-01');
        $endDate   = $this->request->getGet('end_date') ?? date('Y-m-d');

        $sales = $this->salesModel
                      ->select('pharmacy_sales.*, u.first_name as sales_person_first_name, u.last_name as sales_person_last_name')
                      ->join('users u', 'u.id = pharmacy_sales.sales_person_id')
                      ->where('sale_date >=', $startDate . ' 00:00:00')
                      ->where('sale_date <=', $endDate . ' 23:59:59')
                      ->orderBy('sale_date', 'DESC')
                      ->findAll();
---
SELECT `pharmacy_sales`.*, `u`.`first_name` as `sales_person_first_name`, `u`.`last_name` as `sales_person_last_name`
FROM `pharmacy_sales`
JOIN `users` `u` ON `u`.`id` = `pharmacy_sales`.`sales_person_id`
WHERE `sale_date` >= '2025-07-01 00:00:00'
AND `sale_date` <= '2025-07-31 23:59:59'
ORDER BY `sale_date` DESC