app/Controllers/Pharmacy/Sales.php

    public function index()
    {
        $medicinesWithPrice = $this->medicineModel
            ->select('pharmacy_medicines.*, pharmacy_batches.selling_price')
            ->join('pharmacy_batches', 'pharmacy_batches.medicine_id = pharmacy_medicines.id', 'left')
            ->where('pharmacy_batches.current_stock >', 0)
            ->where('pharmacy_batches.expiry_date >', date('Y-m-d'))
            ->groupBy('pharmacy_medicines.id')
            ->findAll();
---
SELECT `pharmacy_medicines`.*, `pharmacy_batches`.`selling_price`
FROM `pharmacy_medicines`
LEFT JOIN `pharmacy_batches` ON `pharmacy_batches`.`medicine_id` = `pharmacy_medicines`.`id`
WHERE `pharmacy_batches`.`current_stock` > 0
AND `pharmacy_batches`.`expiry_date` > '2025-09-16'
GROUP BY `pharmacy_medicines`.`id`

        } else {
            // This is the updated logic for the 'all' bills view
            // 1. Fetch Out-Patient bills
            $outsideBills = $this->db->table('pharmacy_sales')
                ->orderBy('sale_date', 'DESC')
                ->get()
                ->getResultArray();

            // 2. Fetch In-Patient bills with patient details
            $inHospitalBills = $this->db->table('pharmacy_billings pb')
                ->select('pb.*, p.first_name, p.last_name, p.phone_number')
                ->join('patients p', 'p.id = pb.patient_id')
                ->orderBy('pb.bill_date', 'DESC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `pharmacy_sales`
ORDER BY `sale_date` DESC
SELECT `pb`.*, `p`.`first_name`, `p`.`last_name`, `p`.`phone_number`
FROM `pharmacy_billings` `pb`
JOIN `patients` `p` ON `p`.`id` = `pb`.`patient_id`
ORDER BY `pb`.`bill_date` DESC

    public function listToday()
    {
        // Check if the user is authenticated.
        if (!session()->get('user_id')) {
            return redirect()->to(site_url('unauthorized'))->with('error', 'You are not authorized to view this page.');
        }

        $today = date('Y-m-d');

        // Fetch all outside sales for today
        $outsideSales = $this->db->table('pharmacy_sales ps')
            ->select('ps.invoice_number AS bill_id, ps.sale_date AS date, ps.outside_patient_name AS patient_name, ps.outside_patient_phone AS phone_number, ps.total_amount, u.first_name AS user_name, "Out-Patient" as type')->join('users u', 'u.id = ps.sales_person_id')
            ->where('DATE(ps.sale_date)', $today)
            ->get()
            ->getResultArray();

        // Fetch all in-hospital bills for today
        $inHospitalBills = $this->db->table('pharmacy_billings pb')
            ->select('pb.bill_id, pb.bill_date AS date, CONCAT(p.first_name, " ", p.last_name) AS patient_name, p.phone_number, pb.total_amount, u.first_name AS user_name, "In-Patient" as type')
            ->join('patients p', 'p.id = pb.patient_id')
            ->join('users u', 'u.id = pb.sales_person_id')
            ->where('DATE(pb.bill_date)', $today)
            ->get()
            ->getResultArray();
---
SELECT `ps`.`invoice_number` AS `bill_id`, `ps`.`sale_date` AS `date`, `ps`.`outside_patient_name` AS `patient_name`, `ps`.`outside_patient_phone` AS `phone_number`, `ps`.`total_amount`, `u`.`first_name` AS `user_name`, "Out-Patient" as `type`
FROM `pharmacy_sales` `ps`
JOIN `users` `u` ON `u`.`id` = `ps`.`sales_person_id`
WHERE DATE(ps.sale_date) = '2025-09-20'
SELECT `pb`.`bill_id`, `pb`.`bill_date` AS `date`, CONCAT(p.first_name, " ", p.last_name) AS patient_name, `p`.`phone_number`, `pb`.`total_amount`, `u`.`first_name` AS `user_name`, "In-Patient" as `type`
FROM `pharmacy_billings` `pb`
JOIN `patients` `p` ON `p`.`id` = `pb`.`patient_id`
JOIN `users` `u` ON `u`.`id` = `pb`.`sales_person_id`
WHERE DATE(pb.bill_date) = '2025-09-20'