app/Controllers/Pharmacy/SalesPersons.php

SELECT *
FROM `users`
WHERE `users`.`id` = '17'
SELECT *
FROM `pharmacy_sales_persons`
WHERE `email` = 'sureshganta@gmail.com'
 LIMIT 1
---
    public function profile($userId = null)
    {
        $session = session();
        $loggedInUserId = $session->get('user_id');
        $loggedInUserRoleId = $session->get('role_id');

        // If no ID is provided, assume the logged-in user wants to see their own profile
        if ($userId === null) {
            $userId = $loggedInUserId;
        }

        // Check permissions: A Sales Person can only view their own profile
        if ($loggedInUserRoleId == 8 && $userId != $loggedInUserId) {
            return redirect()->back()->with('error', 'You are not authorized to view this profile.');
        }

        // Load the models
        $userModel = new \App\Models\UserModel();
        $salesPersonModel = new \App\Models\Pharmacy\PharmacySalesPersonModel();
        $billingModel = new PharmacyBillingModel();
        $salesModel = new PharmacySalesModel();

        // Fetch user and salesperson data
        $user = $userModel->find($userId);
        if (!$user) {
            return redirect()->back()->with('error', 'User not found.');
        }

        // Fetch the salesperson's profile from the pharmacy table based on user's email
        $salesPerson = $salesPersonModel->where('email', $user['email'])->first();