app/Controllers/AppointmentController.php

    public function index()
    {
        $data['title'] = 'Current Appointments'; // Changed title to reflect filtered view

        $data['appointments'] = $this->appointmentModel
            ->select('appointments.*, patients.first_name as patient_first_name, patients.last_name as patient_last_name, doctors.first_name as doctor_first_name, doctors.last_name as doctor_last_name')
            ->join('patients', 'appointments.patient_id = patients.id')
            ->join('doctors', 'appointments.doctor_id = doctors.id')
            ->whereIn('appointments.status', ['Pending', 'Confirmed']) // Only show Pending or Confirmed
            ->orderBy('appointment_date', 'ASC') // Order by date, then time
            ->orderBy('appointment_time', 'ASC')
            ->findAll();
---
SELECT `appointments`.*, `patients`.`first_name` as `patient_first_name`, `patients`.`last_name` as `patient_last_name`, `doctors`.`first_name` as `doctor_first_name`, `doctors`.`last_name` as `doctor_last_name`
FROM `appointments`
JOIN `patients` ON `appointments`.`patient_id` = `patients`.`id`
JOIN `doctors` ON `appointments`.`doctor_id` = `doctors`.`id`
WHERE `appointments`.`status` IN ('Pending','Confirmed')
AND `appointments`.`deleted_at` IS NULL
ORDER BY `appointment_date` ASC, `appointment_time` ASC

    public function history()
    {
        $data['appointments'] = $this->appointmentModel
            ->select('appointments.*, patients.first_name as patient_first_name, patients.last_name as patient_last_name, doctors.first_name as doctor_first_name, doctors.last_name as doctor_last_name')
            ->join('patients', 'appointments.patient_id = patients.id')
            ->join('doctors', 'appointments.doctor_id = doctors.id')
            ->whereIn('appointments.status', ['Completed', 'Cancelled']) // Include both Completed and Cancelled
            ->orderBy('appointment_date', 'DESC')
            ->orderBy('appointment_time', 'DESC') // Order by latest completed/cancelled first
            ->findAll();
---
SELECT `appointments`.*, `patients`.`first_name` as `patient_first_name`, `patients`.`last_name` as `patient_last_name`, `doctors`.`first_name` as `doctor_first_name`, `doctors`.`last_name` as `doctor_last_name`
FROM `appointments`
JOIN `patients` ON `appointments`.`patient_id` = `patients`.`id`
JOIN `doctors` ON `appointments`.`doctor_id` = `doctors`.`id`
WHERE `appointments`.`status` IN ('Completed','Cancelled')
AND `appointments`.`deleted_at` IS NULL
ORDER BY `appointment_date` DESC, `appointment_time` DESC