app/Controllers/CasualtyController.php

    public function index()
    {
        $data['title'] = 'Casualty / ER Management';
        // Use the new method from PatientModel to get only Casualty patients
        $data['patients'] = $this->patientModel->where('patient_type', 'Casualty')->findAll();
---
SELECT *
FROM `patients`
WHERE   (
`patient_type` = 'Casualty'
OR `patient_type` = 'IPD'
 )