app/Controllers/Doctors.php

    public function index()
    {
        // --- THIS IS THE CORRECTED PART FOR DISPLAYING DEPARTMENT NAME ---
        // Changed 'departments' to 'hospital_departments'
        // Changed 'departments.department_name' to 'hospital_departments.name'
        $doctors = $this->doctorModel
            ->select('doctors.*, hospital_departments.name AS department_name') // Select department 'name' and alias it as 'department_name' for consistency
            ->join('hospital_departments', 'hospital_departments.id = doctors.department_id', 'left')
            ->findAll(); // Or ->paginate() if you are using pagination
---
SELECT `doctors`.*, `hospital_departments`.`name` AS `department_name`
FROM `doctors`
LEFT JOIN `hospital_departments` ON `hospital_departments`.`id` = `doctors`.`department_id`

    public function view($id = null)

    {

        // Fetch doctor details, including the department name

        $doctor = $this->doctorModel

            ->select('doctors.*, hospital_departments.name AS department_name, users.username AS user_username, users.email AS user_email')

            ->join('hospital_departments', 'hospital_departments.id = doctors.department_id', 'left')

            ->join('users', 'users.id = doctors.user_id', 'left') // Join with users table to get username/email

            ->find($id);



        if (!$doctor) {

            return redirect()->to(base_url('doctors'))->with('error', 'Doctor not found.');
---
SELECT `doctors`.*, `hospital_departments`.`name` AS `department_name`, `users`.`username` AS `user_username`, `users`.`email` AS `user_email`
FROM `doctors`
LEFT JOIN `hospital_departments` ON `hospital_departments`.`id` = `doctors`.`department_id`
LEFT JOIN `users` ON `users`.`id` = `doctors`.`user_id`
WHERE `doctors`.`id` = '28'
SELECT `doctors`.*, `hospital_departments`.`name` AS `department_name`, `users`.`username` AS `user_username`, `users`.`email` AS `user_email`
FROM `doctors`
LEFT JOIN `hospital_departments` ON `hospital_departments`.`id` = `doctors`.`department_id`
LEFT JOIN `users` ON `users`.`id` = `doctors`.`user_id`
WHERE `doctors`.`id` = '41'