app/Controllers/GeneralController.php

SELECT *
FROM `patients`
WHERE   (
`patient_type` = 'General'
OR `patient_type` = 'IPD'
 )
---
    public function index()
    {
        $data['title'] = 'General Patient Management';
        // Fetch patients who are currently 'General' OR 'IPD'
        // This ensures patients who transition from General to IPD are still visible on this list.
        $data['patients'] = $this->patientModel
                                    ->groupStart()
                                    ->where('patient_type', 'General')
                                    ->orWhere('patient_type', 'IPD')
                                    ->groupEnd()
                                    ->findAll();