app/Controllers/IpdController.php

    public function index()
    {
        $data['title'] = 'IPD Management';

        // Fetch all patients who are currently marked as 'IPD'
        $ipdPatients = $this->patientModel->where('patient_type', 'IPD')->findAll();
---
SELECT *
FROM `patients`
WHERE `patient_type` = 'IPD'