app/Controllers/OpdController.php

    public function index()
    {
        $data['title'] = 'OPD Management';
        // Use the new method from PatientModel to get only OPD patients
        $data['patients'] = $this->patientModel->where('patient_type', 'OPD')->findAll();
---
SELECT *
FROM `patients`
WHERE   (
`patient_type` = 'OPD'
OR `patient_type` = 'IPD'
 )