app/Controllers/Patients.php

SELECT *
FROM `referred_persons`
---
    public function register()
    {
        $data['title'] = 'Register New Patient';
        $data['validation'] = \Config\Services::validation();

        // Fetch doctors and referred persons for dropdowns
        $data['doctors'] = $this->doctorModel->findAllDoctors();
        $data['referred_persons'] = $this->referredPersonModel->findAll();

SELECT *
FROM `patients`
WHERE `patients`.`id` = '21'
---
                    }
                }

                $updatedPatient = $this->patientModel->find($patientId);

SELECT *
FROM `doctors`
WHERE `doctors`.`id` = '43'
SELECT *
FROM `patients`
WHERE `patients`.`id` = '47'
SELECT *
FROM `referred_persons`
WHERE `referred_persons`.`id` = '2'
---
    public function view($id = null)
    {
        $patient = $this->patientModel->find($id);

        if (!$patient) {
            return redirect()->to('/patients')->with('error', 'Patient not found.');
        }

        $referredDoctor = null;
        if (!empty($patient['referred_to_doctor_id'])) {
            $doctorModel = new \App\Models\DoctorModel();
            $referredDoctor = $doctorModel->find($patient['referred_to_doctor_id']);
        }

        $referredByPerson = null;
        if (!empty($patient['referred_by_id'])) {
            $referredPersonModel = new \App\Models\ReferredPersonModel();
            $referredByPerson = $referredPersonModel->find($patient['referred_by_id']);