app/Controllers/Patients.php

SELECT *
FROM `patients`
WHERE `patients`.`id` = '30'
SELECT *
FROM `referred_persons`
SELECT *
FROM `appointments`
WHERE `patient_id` = '30'
AND `appointments`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 1
---
    public function edit($id = null)
    {
        $data['title'] = 'Edit Patient';
        $data['validation'] = \Config\Services::validation();

        $patient = $this->patientModel->find($id);
        if (!$patient) {
            session()->setFlashdata('error', 'Patient not found.');
            return redirect()->to('/patients');
        }

        $data['patient'] = $patient;
        $data['doctors'] = $this->doctorModel->findAllDoctors();
        $data['referred_persons'] = $this->referredPersonModel->findAll();

        $appointment = $this->appointmentModel
            ->where('patient_id', $id)
            ->orderBy('id', 'desc')
            ->first();