app/Controllers/Specialization.php

    public function index()
    {
        $data = [
            'title' => 'Manage Hospital Specializations',
            'specializations' => $this->specializationModel->findAll(),
---
SELECT *
FROM `specializations`
WHERE `specializations`.`deleted_at` IS NULL

    public function update($id = null)
    {
        $postData = $this->request->getPost();

        // Dynamically replace the {id} placeholder in the 'is_unique' rule
        $rules = $this->specializationModel->getValidationRules(['except' => ['id']]);

        // Ensure the rule for 'name' is retrieved and updated
        if (isset($rules['name'])) {
            $rules['name'] = str_replace('{id}', $id, $rules['name']);
            $this->specializationModel->setValidationRules($rules);
        }


        // Run validation
        if (!$this->specializationModel->validate($postData)) {
            // Re-fetch the specialization if validation fails
            $specialization = $this->specializationModel->find($id);
            return redirect()->back()->withInput()->with('errors', $this->specializationModel->errors())
                ->with('specialization', $specialization);
        }

        // Add the ID to the data array for the update method
        $postData['id'] = $id;

        $this->specializationModel->save($postData); // save handles update if PK is present
---
UPDATE `specializations` SET `name` = 'sampe', `description` = 'dbftrstewcwecw', `updated_at` = '2025-10-16 10:59:18'
WHERE `specializations`.`id` IN ('11')