app/Controllers/Staff/Staff.php

SELECT `users`.*, `roles`.`name` AS `role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`role_id` IN (3,4,5,6,7,8,9)
---
    public function index()
    {
        // Fetch staff details along with their role name
        $data['staff'] = $this->userModel
            ->select('users.*, roles.name AS role_name')
            ->join('roles', 'roles.id = users.role_id')
            ->whereIn('users.role_id', $this->staffRoleIds)
            ->findAll();

SELECT *
FROM `roles`
WHERE `id` IN (3,4,5,6,7,8,9)
---
    public function register()
    {
        // 1. Fetch only the roles that staff can be registered as
        $data['roles'] = $this->roleModel->whereIn('id', $this->staffRoleIds)->findAll();