app/Models/DoctorModel.php

SELECT `id`, `doctor_id_code`, `first_name`, `last_name`, `specialization`, `email`, `phone_number`, `designation`, `opd_fee`
FROM `doctors`
---
    public function findAllDoctors()
    {
        return $this->select('id, doctor_id_code, first_name, last_name, specialization, email, phone_number, designation, opd_fee')
            ->findAll();