app/Models/PatientModel.php

    protected function generateTypeSpecificIDsOnUpdate(array $data)
    {
        if (isset($data['id']) && is_array($data['id']) && !empty($data['id']) &&
            isset($data['data']) && array_key_exists('patient_type', $data['data'])) {

            $patientId = $data['id'][0];
            $currentPatient = $this->find($patientId);
---
SELECT *
FROM `patients`
WHERE `patients`.`id` = 21

    public function admitPatientToIPD(int $patientId, array $admissionData): bool
    {
        $this->db->transBegin();

        try {
            $patient = $this->find($patientId);
---
SELECT *
FROM `patients`
WHERE `patients`.`id` = 21

                log_message('info', 'Preserving existing IPD ID ' . $patient['ipd_id_code'] . ' for patient ' . $patientId . ' during admission.');
            }

            $this->update($patientId, $updateData);
---
UPDATE `patients` SET `patient_type` = 'IPD', `previous_patient_type` = 'General', `ipd_id_code` = 'IPD-250726-00044', `updated_at` = '2025-07-26 09:53:29'
WHERE `patients`.`id` IN (21)