app/Models/PatientAdmissionModel.php

SELECT *
FROM `patient_admissions`
WHERE `patient_id` = 17
AND `admission_status` IN ('Admitted','Waiting Assignment')
AND `patient_admissions`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getActiveAdmissionForPatient(int $patientId): ?array
    {
        return $this->where('patient_id', $patientId)
                    ->whereIn('admission_status', ['Admitted', 'Waiting Assignment'])
                    ->first();