app/Models/UserModel.php

SELECT `users`.*, `roles`.`name` as `role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`id` = '35'
---
    public function find($id = null)
    {
        // Use the query builder for a single ID lookup, which is what the controller expects.
        if (is_numeric($id) || (is_array($id) && count($id) === 1)) {
            $builder = $this->db->table('users');
            // Select all user fields and the role name
            $builder->select('users.*, roles.name as role_name');
            $builder->join('roles', 'roles.id = users.role_id');
            $builder->where('users.id', is_array($id) ? $id[0] : $id);
            return $builder->get()->getRowArray();

SELECT `users`.`id`, `users`.`first_name`, `users`.`last_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`management_level` = 'Department Head'
ORDER BY `users`.`last_name` ASC
---
    public function getDepartmentHeads(): array
    {
        $builder = $this->db->table('users');
        $builder->select('users.id, users.first_name, users.last_name');
        $builder->join('roles', 'roles.id = users.role_id');
        // Filter users by the management_level we defined
        $builder->where('roles.management_level', 'Department Head');
        $builder->orderBy('users.last_name', 'ASC');

        return $builder->get()->getResultArray();