app/Models/Diagnostics/DiagnosticsOrderModel.php

SELECT `diagnostics_orders`.*, CONCAT_WS(' ', `users`.`first_name`, users.last_name) as doctor_name, -- Joins to items and tests to get the service name
                GROUP_CONCAT(DISTINCT T.test_name SEPARATOR ', ') AS procedure_name, -- Joins to items and files to get the report path
                GROUP_CONCAT(DISTINCT R.file_path SEPARATOR ', ') AS report_file_path
FROM `diagnostics_orders`
LEFT JOIN `users` ON `users`.`id` = `diagnostics_orders`.`ordered_by`
LEFT JOIN `diagnostics_order_items` `OI` ON `OI`.`diagnostics_order_id` = `diagnostics_orders`.`id`
LEFT JOIN `diagnostics_tests` `T` ON `T`.`id` = `OI`.`diagnostics_test_id`
LEFT JOIN `diagnostics_order_files` `R` ON `R`.`diagnostics_order_item_id` = `OI`.`id`
WHERE `diagnostics_orders`.`patient_id` = 47
GROUP BY `diagnostics_orders`.`id`
ORDER BY `diagnostics_orders`.`order_date` DESC
---
    public function getDiagnosticsOrdersForPatient(int $patientId)
    {
        return $this->select("
                diagnostics_orders.*,
                CONCAT_WS(' ', users.first_name, users.last_name) as doctor_name,
                -- Joins to items and tests to get the service name
                GROUP_CONCAT(DISTINCT T.test_name SEPARATOR ', ') AS procedure_name,
                -- Joins to items and files to get the report path
                GROUP_CONCAT(DISTINCT R.file_path SEPARATOR ', ') AS report_file_path
            ")
            // Join for the doctor's name (Ordered By)
            ->join('users', 'users.id = diagnostics_orders.ordered_by', 'left')

            // 1. Join to the intermediate item table to find the specific tests ordered
            // (Assumes: diagnostics_order_items.diagnostics_order_id = diagnostics_orders.id)
            ->join('diagnostics_order_items OI', 'OI.diagnostics_order_id = diagnostics_orders.id', 'left')

            // 2. Join to the tests table to get the test name (aliased as procedure_name)
            // (Assumes: diagnostics_tests.id = diagnostics_order_items.diagnostics_test_id)
            ->join('diagnostics_tests T', 'T.id = OI.diagnostics_test_id', 'left')

            // 3. Join to the files table to get the report path (aliased as report_file_path)
            // (Assumes: diagnostics_order_files.diagnostics_order_item_id = diagnostics_order_items.id)
            ->join('diagnostics_order_files R', 'R.diagnostics_order_item_id = OI.id', 'left')

            ->where('diagnostics_orders.patient_id', $patientId)

            // Group by the order ID to return one row per diagnostic order, even if it has multiple items/files
            ->groupBy('diagnostics_orders.id')

            ->orderBy('diagnostics_orders.order_date', 'DESC')
            ->findAll();