app/Models/Laboratory/LabOrderModel.php

SELECT `lab_orders`.*, CONCAT_WS(" ", `users`.`first_name`, users.last_name) as doctor_name, GROUP_CONCAT(LT.name SEPARATOR ", ") AS test_names, GROUP_CONCAT(LF.file_path SEPARATOR ", ") AS report_file_paths
FROM `lab_orders`
LEFT JOIN `users` ON `users`.`id` = `lab_orders`.`ordered_by`
LEFT JOIN `lab_order_items` `LOI` ON `LOI`.`lab_order_id` = `lab_orders`.`id`
LEFT JOIN `lab_tests` `LT` ON `LT`.`id` = `LOI`.`lab_test_id`
LEFT JOIN `lab_order_files` `LF` ON `LF`.`lab_order_item_id` = `LOI`.`id`
WHERE `lab_orders`.`patient_id` = 47
GROUP BY `lab_orders`.`id`
ORDER BY `lab_orders`.`order_date` DESC
---
    public function getLabOrdersForPatient(int $patientId)
    {
        return $this->select(
            'lab_orders.*, ' .
            'CONCAT_WS(" ", users.first_name, users.last_name) as doctor_name, ' .
            // Aggregates all test names associated with the order
            'GROUP_CONCAT(LT.name SEPARATOR ", ") AS test_names, ' .
            // Aggregates all attached file paths for reports
            'GROUP_CONCAT(LF.file_path SEPARATOR ",") AS report_file_paths'
        )
        ->where('lab_orders.patient_id', $patientId)
        // Join to get ordering doctor's name
        ->join('users', 'users.id = lab_orders.ordered_by', 'left')
        // Join to get test names
        ->join('lab_order_items LOI', 'LOI.lab_order_id = lab_orders.id', 'left')
        ->join('lab_tests LT', 'LT.id = LOI.lab_test_id', 'left')
        // Join to get report file paths (reports are linked to the order item)
        ->join('lab_order_files LF', 'LF.lab_order_item_id = LOI.id', 'left')
        ->groupBy('lab_orders.id')
        ->orderBy('lab_orders.order_date', 'DESC')
        ->findAll();